# Join and Merge

In [9]:
import pandas as pd
import numpy as np

In [10]:
# Dataframe of number of sales made by an employes
sales = {'Jones' : 10000,
        'Chris' : 5000,
        'Piyush' : 440,
        'Meera' : 6700,
        'Rahul' : 300
        }

# Dataframe of all employees and the region they work in
region = {'Jones': 'West',
         'Chris': np.nan,
         'Piyush': 'West',
         'Meera': np.nan,
         'Anthony': 'East',
         'Ellen': 'South',
         'Josh': 'West',
         'Simran': 'East',
         'Oscar': 'North',
         }

In [11]:
# Convert dictionary to datframes
sales_df = pd.DataFrame.from_dict(sales, orient='index',
                                 columns=['sales'])
region_df = pd.DataFrame.from_dict(region, orient='index',
                                  columns=['region'])

In [12]:
sales_df

        sales
Jones   10000
Chris    5000
Piyush    440
Meera    6700
Rahul     300

In [13]:
region_df

        region
Jones     West
Chris      NaN
Piyush    West
Meera      NaN
Anthony   East
Ellen    South
Josh      West
Simran    East
Oscar    North

# Join

In [14]:
# It treats the region_df as left table and the sales_df as right 
# Table and therefore all the items in region_df will appear and only
# Those items in sales_df that matches with region_df will appear

joined_df = region_df.join(sales_df, how='left')
print(joined_df)

        region    sales
Jones     West  10000.0
Chris      NaN   5000.0
Piyush    West    440.0
Meera      NaN   6700.0
Anthony   East      NaN
Ellen    South      NaN
Josh      West      NaN
Simran    East      NaN
Oscar    North      NaN

In [16]:
# It treats the region_df as left table and the sales_df as right
# Table and therefore all the items in sales_df will appear and only
# those items in region_df that matches with region_df will appear

joined_df = region_df.join(sales_df, how='right')
print(joined_df)

       region  sales
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700
Rahul     NaN    300

In [17]:
joined_df = region_df.join(sales_df, how='inner')          # Here Rahul will not appear since it is not in both of the dataframes
print(joined_df)

       region  sales
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700

In [18]:
joined_df = region_df.join(sales_df, how='outer')           # Joining all the data points in both dataframes
print(joined_df)

        region    sales
Anthony   East      NaN
Chris      NaN   5000.0
Ellen    South      NaN
Jones     West  10000.0
Josh      West      NaN
Meera      NaN   6700.0
Oscar    North      NaN
Piyush    West    440.0
Rahul      NaN    300.0
Simran    East      NaN

# Merge

In [19]:
# Give title to the index column

region_df.index.name='names'
sales_df.index.name='names'

In [20]:
print(pd.merge(region_df, sales_df, on='names'))   # Merge on a key (NB : you can also merge on multiple keys)

       region  sales
names
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700

In [21]:
print(pd.merge(region_df, sales_df, on='names', how='left'))

        region    sales
names
Jones     West  10000.0
Chris      NaN   5000.0
Piyush    West    440.0
Meera      NaN   6700.0
Anthony   East      NaN
Ellen    South      NaN
Josh      West      NaN
Simran    East      NaN
Oscar    North      NaN

In [22]:
print(pd.merge(region_df, sales_df, on='names', how='right'))

       region  sales
names
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700
Rahul     NaN    300

In [23]:
print(pd.merge(region_df, sales_df, on='names', how='inner'))

       region  sales
names
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700

In [25]:
print(pd.merge(region_df, sales_df, on='names', how='outer'))

        region    sales
names
Jones     West  10000.0
Chris      NaN   5000.0
Piyush    West    440.0
Meera      NaN   6700.0
Anthony   East      NaN
Ellen    South      NaN
Josh      West      NaN
Simran    East      NaN
Oscar    North      NaN
Rahul      NaN    300.0